{
  "add_cross_attention": false,
  "architectures": [
    "XLMRobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "balance_transfer",
    "1": "check_data_usage",
    "2": "feedback",
    "3": "goodbye",
    "4": "greeting",
    "5": "network_complaint",
    "6": "network_status",
    "7": "no_signal",
    "8": "offer_inquiry",
    "9": "other",
    "10": "payment_issue",
    "11": "renew_package",
    "12": "slow_internet",
    "13": "technical_support"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "balance_transfer": 0,
    "check_data_usage": 1,
    "feedback": 2,
    "goodbye": 3,
    "greeting": 4,
    "network_complaint": 5,
    "network_status": 6,
    "no_signal": 7,
    "offer_inquiry": 8,
    "other": 9,
    "payment_issue": 10,
    "renew_package": 11,
    "slow_internet": 12,
    "technical_support": 13
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "xlm-roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "tie_word_embeddings": true,
  "transformers_version": "5.0.0",
  "type_vocab_size": 1,
  "use_cache": false,
  "vocab_size": 250002
}
