{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": null,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_dim": 3072,
  "id2label": {
    "0": "balance_transfer",
    "1": "check_data_usage",
    "2": "feedback",
    "3": "goodbye",
    "4": "greeting",
    "5": "network_complaint",
    "6": "network_status",
    "7": "no_signal",
    "8": "offer_inquiry",
    "9": "other",
    "10": "payment_issue",
    "11": "renew_package",
    "12": "slow_internet",
    "13": "technical_support"
  },
  "initializer_range": 0.02,
  "label2id": {
    "balance_transfer": 0,
    "check_data_usage": 1,
    "feedback": 2,
    "goodbye": 3,
    "greeting": 4,
    "network_complaint": 5,
    "network_status": 6,
    "no_signal": 7,
    "offer_inquiry": 8,
    "other": 9,
    "payment_issue": 10,
    "renew_package": 11,
    "slow_internet": 12,
    "technical_support": 13
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.0.0",
  "use_cache": false,
  "vocab_size": 30522
}
